Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: དེའི་འོག་ཏུ་ལྷ་མོ་དཔལ་ཆེན་མོའི་ནུ་མ་གཉིས་ལས་འོ་མའི་རྒྱུན་འབྱུང་བར་འགྱུར་ཏེ།
en: The two breasts of the great goddess Śrī will subsequently release streams of milk, which the vidyā holder should catch in his mouth and drink.

source: འོ་མའི་རྒྱུན་དེ་ཁས་ཟེད་དེ་འཐུངས་པ་ཙམ་གྱི་མོད་ལ་ལྷའི་མེ་ཏོག་པདྨ་དང་ཀུ་མུ་ད་ལྟར་འཇམ་པའི་ལྷའི་ལུས་སུ་འགྱུར་སྐྲ་ཅུང་ཟད་འཁྱིལ་ཅིང་འཁྱིལ་ལ་མིག་ཨུཏྤལ་སྔོན་པོ་ལྟ་བུ་དང་ཚིག་གསལ་ཞིང་མི་འམ་ཅིའི་སྒྲ་དབྱངས་དང་ལྡན་པར་འགྱུར།
en: As soon as he drinks the milk he will obtain a divine body, one that is delicate like divine lotuses and water lilies. His hair will become curly and wavy, and his eyes will turn blue like an utpala lotus. He will also obtain the gift of eloquence and a voice sounding like that of a kinnara, identical in timbre and sound.

source: དོན་ཡོད་པའི་རྒྱ་མཚོའི་ནོར་བུ་ཆེན་པོ་པདྨ་ལ་རྣམ་པར་བལྟ་བའི་དཔལ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་མངོན་སུམ་དུ་འགྱུར།
en: He will manifest as a lotus king by the name Amogha-Ocean-Like Immaculate Splendor with the Gaze of the Great Holder of the Jewel and the Lotus.

source: ཆོ་ག་ཞིབ་མོ་མང་པོ་འགྲུབ་པར་འགྱུར་ཚེ་ལོ་སྟོང་ཕྲག་བཅུ་ཐུབ་པར་འགྱུར།
en: He will accomplish the rites with great success and will live ten thousand years.

source: རྒྱལ་བ་འོད་དཔག་མེད་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་བཅས་པ་ཐབས་ཅིག་ཏུ་གཞལ་མེད་ཁང་མཆོག་ན་ཆོས་བགྲོ་བ་མཐོང་བར་འགྱུར།
en: He will behold the victorious Amitābha chanting the Dharma instructions in chorus with the hosts of bodhisattvas in their fine palaces. “

source: རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར། ནོར་བུ་ཆེན་པོ་པདྨ་ལ་ལྟ་བ་ཞེས་བྱ་བ་དོན་ཡོད་པའི་ཞགས་པ་ཆེན་པོའི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར།
en: He will be able to travel magically through the sky and will become a great emperor who carries the unfailing noose and goes by the name One with the Great Gaze of the Holder of the Jewel and the Lotus.

source: རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱིས་འཁོར་ལོས་སྒྱུར་བའི་གཙོ་བོ་གཅིག་པུར་འགྱུར།
en: He will be the emperor and lord of all the vidyādharas.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྲས་སུ་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྲས་གཅིག་པུར་འགྱུར། ལྷ་དང་།
en: He will become a son of Noble Avalokiteśvara and the celestial son of all the tathāgatas.

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: All devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas will regard him as their one and only eldest son.

source: མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱི་བུའི་གཙོ་བོ་གཅིག་པུར་འགྱུར་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་བུ་གཅིག་པུར་འགྱུར།
en: The Four Great Kings, too, will treat him as their only son.

source: ཐམས་ཅད་དུ་སྟོབས་དང་། ཕ་རོལ་གནོན་པ་དང་། བརྩོན་འགྲུས་ཐོགས་པ་མེད་པ་དང་ལྡན་པར་འགྱུར།
en: He will be invincible, strong, powerful, and valiant in every way.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་དང་དཀྱིལ་འཁོར་རིམ་པ་ཕྱེ་བ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་གསང་བའི་གཟུངས་ཀྱི་རྒྱལ་པོ་ཆོ་ག་ཞིབ་མོ་ཟབ་པ་དག་མངོན་སུམ་དུ་འགྱུར།
en: All the profound instructions of the tathāgatas on mudrās, maṇḍalas, kings of vidyās, secret mantras, and secret dhāraṇī mantras, as well as all the sovereign rituals, will be clearly revealed to him. “

source: ལྷ་ཐམས་ཅད་ཀྱི་གནས་དང་། ཀླུ་ཐམས་ཅད་ཀྱི་གནས་དང་། མི་འམ་ཅི་ཐམས་ཅད་ཀྱི་གནས་དང་། ཕུག་དང་ཁུང་གི་གནས་ཐམས་ཅད་སྒོ་འབྱེ་བར་འགྱུར།
en: All the dwellings of devas, nāgas, and kinnaras, as well as all palaces accessible via secret passages, will remain open to the vidyā holder.

source: གནོད་སྦྱིན་དང་སྲིན་པོའི་གནས་ཐམས་ཅད་སྒོ་འབྱེ་བར་འགྱུར་རོ།
en: Likewise, all the residences of yakṣas and rākṣasas will be open for him.

source: ཐམས་ཅད་དབང་དུ་འགྱུར་ཞིང་བགྱི་བ་ཅི་མཆིས་ཞེས་བྱ་བ་བྱེད་ཅིང་འདུག་པར་འགྱུར།
en: All these beings will fall under his thrall and will remain his eager servants.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སྟོན་པ་བླ་མ་གཅིག་པུ་འཇིག་རྟེན་མགོན་པོ་དང་འདྲ་བར་མཆོད་པའི་གནས་སུ་འགྱུར།
en: Just like the Lord of the World, the vidyā holder will become a universal teacher and instructor for all the people who honor him with offerings.

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་གསང་སྔགས་དང་དཀྱིལ་འཁོར་ཐམས་ཅད་གྲུབ་པ་ཆེན་པོར་འགྱུར།
en: He will become an accomplished master of all worldly and supramundane mantras and maṇḍalas. “

source: དཔལ་ལྷ་མོ་ཆེན་མོ་འཁོར་དང་བཅས་པ་ལ་སྦྱིན་སྲེག་བྱས་ན་རིག་སྔགས་འཆང་དེ་ལ་བུ་བཞིན་དུ་བྱམས་པས་རང་ཉིད་བསྙེན་བཀུར་ཡོངས་སུ་སྤྱད་བས་ཡོངས་སུ་སྤྱོད་དོ།
en: The great goddess Śrī, together with her retinue, will attend upon him out of motherly love, rendering help and assistance.

source: །འདོད་པ་ཐམས་ཅད་དང་ཡིད་དུ་འོང་བ་ཐམས་ཅད་ཀྱི་དགོས་པ་བྱེད་པར་འགྱུར་རོ། །ནོར་དང་། འབྲུ་དང་། དབྱིག་དང་།
en: She will fulfill all his desires and do all tasks according to his wishes.

source: གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། ཤང་ཁ་ཤི་ལ་དང་། བྱི་རུ་དང་།
en: She will bring him money, grain, wrought gold, gold bullion, jewels, pearls, beryl stones, conch-like stones, coral, silver, and even celestial jewels and gems.

source: ས་ལེ་སྦྲམ་དང་། དངུལ་དང་། ལྷའི་ནོར་བུ་ཆེན་པོ་རིན་པོ་ཆེའི་བར་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དོ། །ཡུལ་ཀ་ཤི་ཀའི་གོས་བཟང་པོ་མང་པོ་སྦྱིན་པར་བྱེད་ཅིང་ལྷའི་བཟའ་བ་དང་། བཏུང་བའི་བར་དང་བདུད་རྩིའི་རོའི་བར་དུ་སྦྱིན་པར་བྱེད་དོ།
en: She will also provide clothes made of divine silk from Vārāṇasī and divine foods and beverages that taste like ambrosia.

source: །གནས་ཐམས་ཅད་དུ་སོང་བ་ན་ཡང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བུ་ལ་བྱམས་པའི་ཚུལ་གྱིས་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་ཞིང་འགྲོ་བར་འགྱུར་རོ།
en: Bound to him by her motherly love, she will always follow the vidyā holder wherever he goes. “

source: །རིག་སྔགས་འཆང་གི་རང་གི་ཁྱིམ་ཡང་རྒྱལ་པོའི་ཕོ་བྲང་ལྕང་ལོ་ཅན་ཇི་ལྟ་བ་བཞིན་དུ་རིག་སྔགས་འཆང་གི་གཞལ་མེད་ཁང་མཆོག་ཏུ་འགྱུར་རོ།
en: The house of the vidyā holder will become a fine palace, like those in the city of Aḍakavatī.

source: །རྣམ་ཐོས་ཀྱི་བུའི་གནས་ན་འབྱོར་པ་ཇི་ལྟ་བ་བཞིན་རྒྱས་པར་འགྱུར་རོ།
en: His wealth will increase just as wealth does in the abode of Vaiśravaṇa.

source: །ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དུས་ཀུན་ཏུ་འོང་བར་འགྱུར་རོ།
en: He will always be attended by Brahmā, Viṣṇu, and Maheśvara.

source: །གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་རྡོ་རྗེ་འཆང་ཡང་རིག་སྔགས་འཆང་གི་ཚོགས་ཐམས་ཅད་དང་། གནོད་སྦྱིན་ཆེན་པོ་གསང་བ་པའི་འཁོར་རྣམས་དང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་།
en: The great, vajra-wielding general of the yakṣas will remain standing by with all his vidyādhara followers, each of them joined by a great retinue of yakṣas and guhyakas, in order to guard, protect and defend the vidyā holder.

source: སྦ་བ་བྱེད་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་དཔལ་ལྷ་མོ་ཆེན་མོ་འཁོར་དང་བཅས་པ་དང་རྣམ་ཐོས་ཀྱི་བུ་གནོད་སྦྱིན་བྱེ་བས་ཡོངས་སུ་བསྐོར་བས་ཉིན་མཚན་དུ་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བ་བྱེད་པར་འགྱུར་རོ།
en: So too will the great goddess Śrī stand by day and night with her retinue, surrounded by tens of millions of Vaiśravaṇa’s yakṣas, in order to guard, protect, and defend him. “

source: །དེ་ནས་དོན་ཡོད་པའི་རྒྱ་མཚོ་ནོར་བུ་ཆེན་པོ་པདྨ་ལ་ལྷའི་དཔལ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་བཀླགས་པས་འགྲུབ་པར་འགྱུར་ཞིང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞིའི་རྡུལ་ཕྲ་མོ་སྙེད་ལས་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར།
en: Now I will teach the heart mantra of Amoghapāśa called immaculately pure great Śrī with the gaze of the Holder of the Jewel and the Lotus who is like an amogha ocean. This mantra will produce accomplishments when recited as part of the sovereign ritual of Amoghapāśa. The vidyā holder will plant roots of virtue equal to the virtue of hundreds of thousands of millions of tathāgatas, as numerous as all the atoms or grains of sand in sixty-four Gaṅgā rivers; it will be as if he were in the presence of these tathāgatas, the worthy, fully realized buddhas.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ།
en: He will thus accumulate a great store of merit. “

source: དགེ་བསྙེན་མ་གང་ལ་ལ་ཞིག་གིས་ལྷའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དང་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་སྣ་བདུན་དང་། ལྷའི་གསེར་དང་། གསེར་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་མང་པོ་དང་། ལྷའི་གོས་དང་། ལྷའི་རྒྱན་དང་། ལྷའི་དྲི་དང་། མེ་ཏོག་དང་།
en: Whether the vidyā holder is a son or daughter of noble family, a monk or nun, or a male or female lay practitioner, their merit will be the same as if they offered divine jewels and gems, the seven types of great jewels and gems, great gold flowers of beautiful golden color, silver flowers, divine cloth, and divine adornments, as well as divinely fragrant flowers, garlands, and unguents piled as high as the top of Mount Sumeru, the king of mountains, and kept offering all these objects every day of the year to each and every tathāgata among the hundreds of thousands of millions of tathāgatas, the worthy, fully realized buddhas, as numerous as the atoms or grains of sand in sixty-four Gaṅgā rivers. “

source: མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་རྣམས་རེ་རེ་ཞིང་འཕང་དུ་རིའི་རྒྱལ་པོ་རི་རབ་ཙམ་གྱི་ཕུང་པོ་བྱས་ནས། དེ་དག་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞིའི་རྡུལ་ཕྲ་མོ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་རེ་རེ་ལ་ཚུལ་དེ་ལྟ་བུས་སོ་སོར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཉིན་རེ་ཞིང་། ལོ་གཅིག་གི་བར་དུ་འབུལ་བར་བྱེད་མཆོད་པ་དང་བསྙེན་བཀུར་བྱེད་ཅིང་དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྤྱན་སྔར་དྲི་ཞིམ་པོ་དང་ལྡན་པའི་ཏིལ་མར་རྒྱ་མཚོ་ཙམ་གྱིས་བཀང་བའི་མར་མེ་བལྟམ་པར་བྱེད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་འགྱུར།
en: The vidyā holder’s merit will be the same as if he made these offerings and then lit, in front of each and every tathāgata, a lamp filled with fragrant oil as vast as the great ocean.

source: དགེ་བའི་རྩ་བ་ཆེན་པོ་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ།
en: He will thus be equipped with the roots of great virtue.

source: །གལ་ཏེ་དོན་ཡོད་པའི་རྒྱ་མཚོའི་ནོར་བུ་ཆེན་པོ་པདྨ་ལ་རྣམ་པར་བལྟ་བའི་དཔལ་དྲི་མ་མེད་པ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་འདི་ཀློག་པ་དང་བཟླས་བརྗོད་བརྒྱ་རྩ་བརྒྱད་བྱེད་པ་འདི་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་དང་ལྡན་པར་འགྱུར་ཞིང་།
en: He will obtain this merit if he displays the mudrā of Amoghapāśa seven times and recites the heart mantra of Amoghapāśa called immaculately pure great Śrī with the gaze of the Holder of the Jewel and the Lotuswho is like an amogha ocean.

source: དགེ་བའི་རྩ་བ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར།
en: This mantra should be recited one hundred and eight times, and as a result the vidyā holder will obtain many roots of virtue.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབ་པར་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གཟུང་བར་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐུ་སྟོན་པར་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ལུང་སྟོན་པར་འགྱུར།
en: He will be blessed by all the tathāgatas, who will appear to him and will all prophesy his future awakening. “

source: དཔལ་ལྷ་མོ་ཆེན་མོ་དེ་ཡང་མཆོག་ཐམས་ཅད་སྦྱིན་པར་འགྱུར།
en: The great goddess Śrī, for her part, will grant the vidyā holder every boon.

source: དུས་ཀུན་ཏུ་དེའི་ཁྱིམ་དུ་དཔལ་གནས་པར་འགྱུར་ཏེ།
en: Prosperity will always dwell in his house.

source: །གང་ན་དཔལ་ལྷ་མོ་ཆེན་མོ་གནས་པ་དེར་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞིའི་རྡུལ་ཕྲ་མོ་དང་མཉམ་པས་ཕྱོགས་དེ་ཉིད་དུ་གནས་པར་འགྱུར་ཏེ།
en: Wherever the great goddess Śrī resides, there, in that very place, hundreds of thousands of millions of tathāgatas—equal in number to the atoms or grains of sand in sixty-four Gaṅgā rivers—will also reside.

source: དཔལ་ལྷ་མོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ་ཡིན་པའི་ཕྱིར་རོ། །ལྷ་དང་། ཀླུ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་།
en: This is because Śrī is the mother of all tathāgatas.

source: དབང་ཕྱུག་ཆེན་པོའི་གསང་སྔགས་དང་། ཆོ་ག་ཞིབ་མོ་དང་། ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་།
en: The great goddess Śrī is said to be paramount for the mantra rites, mudrās, and maṇḍalas of all the gods and nāgas and of Brahmā, Viṣṇu, and Maheśvara.

source: ཞི་བ་དང་། རྒྱས་པ་དང་། དྲག་ཤུལ་སྤྱོད་པ་དང་། ལས་སྣ་ཚོགས་གཞན་དག་པས་དཔལ་ལྷ་མོ་ཆེན་མོའི་ལས་མཆོག་ཏུ་སྟོན་ཏོ།
en: She is also said to be supreme in pacifying, nourishing, assaulting, and various other activities. “

source: །དཔལ་ལྷ་མོ་ཆེན་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཡུམ་ཡིན་ནོ།
en: The great goddess Śrī is the universal mother and progenitress. She is the mother of all bodhisattvas, and her amogha accomplishment is unfailing.

source: །དཔལ་ལྷ་མོ་ཆེན་མོ་ནི་དོན་ཡོད་པའི་མཆོག་སྦྱིན་པའོ། །དོན་ཡོད་པའི་ཞགས་པ་སྦྱིན་པའོ། །དོན་ཡོད་པའི་གྲགས་པ་རྒྱ་ཆེན་པོ་སྦྱིན་པའོ།
en: She grants amogha boons and generously distributes his gifts, and she brings the vidyā holder great amogha renown.

source: །དོན་ཡོད་པའི་ནམ་མཁའི་གཞལ་མེད་ཁང་འཆང་བའོ། །དོན་ཡོད་པའི་ཡོན་ཏན་བསྒྲགས་པའི་མཆོག་སྦྱིན་པའོ།
en: She possesses the finest amogha palaces in the sky and grants the boon of fame that comes from possessing amogha qualities.

source: །དཔལ་ལྷ་མོ་ཆེན་པོ་ནི་དོན་ཡོད་པའི་ཟླ་བ་དང་།
en: The great goddess Śrī is the source of the amogha splendor of the moon and the sun.

source: ཉི་མའི་འོད་བྱེད་པ་གནས་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་ནང་ན་དཔལ་ལྷ་མོ་ཆེན་མོ་མཆོག་ཏུ་བསྟན་ཏོ།
en: She is the most eminent being in the thirty-two abodes. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་ཁྲུས་ལེགས་པར་བྱས་པ་དྲི་ཆུས་བསངས་ཤིང་བ་ལས་བྱུང་བ་ལྔས་བྱུགས་པ། གོས་གཙང་མ་བགོས་པས་ཁ་ཟས་གཙང་མ་བཟའ་བར་བྱ་ཞིང་ཆང་དང་། ཤ་དང་བིག་བཙོང་དང་། སྒོག་སྐྱ་དང་ཀེའུ་རྣམས་དང་། འདྲེས་པ་དང་།
en: The vidyā holder should be ritually pure, thoroughly bathed, sprinkled with scented water, and anointed with the five products of the cow.

source: འབགས་པ་རྣམས་ཡོངས་སུ་སྤང་བར་བྱ། ཁ་ཟས་ངན་པ་དང་། བཏུང་བ་ངན་པ་དང་། གོས་ངན་པ་དང་། དྲི་མ་ཅན་ཡོངས་སུ་སྤང་བར་བྱ། སེམས་ཅན་ངན་པ་དང་། རྟེན་པ་དང་། ངན་གཡོ་ཅན་དང་།
en: He should wear clean clothes and subsist on pure food, while avoiding alcohol, meat, onions, garlic, red onions, mixed foods, leftover food, food or drink that has gone off, smelly food, or contaminated food.

source: གསོད་སྐྱེན་ཅན་དང་། སྐྱེ་བོ་ངན་པ་ཅན་དང་། ཁྲེལ་མེད་པ་དང་། སྙིང་རྗེ་མེད་པ་དང་། བྱམས་པ་དང་བྲལ་བ་དང་། ཐུབ་ཆོད་ཅན་གྱི་སྐྱེ་བོ་ངན་པ་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: He should avoid associating with wicked beings, people who are bad, deceitful, murderous, malicious, or ungrateful, people who lack compassion and loving kindness, and people who are inconsiderate.

source: །གནས་ངན་པ་དང་། གནས་རྟེན་ངན་པ་དང་། བགོ་མཉེས་དང་། བཟའ་ཉེས་དང་། གྲིབ་མ་ངན་པ་ཡོངས་སུ་སྤང་བར་བྱ།
en: He should avoid bad places and dwellings, indigestible food, foul-tasting food, food spoiled by chāyās, shared food, and food left uneaten by others. “

source: གཅིག་གིས་གཅིག་འབགས་པའི་ཁ་ཟས་ངན་པ་ཡོངས་སུ་སྤང་བར་བྱ་ཞིང་དྲི་དང་བདུག་སྤོས་ཀྱིས་བསངས་ཏེ་མི་སྨྲ་བར་བཟླས་བརྗོད་བྱ། བྱམས་པ་དང་། སྙིང་རྗེ་དང་།
en: The vidyā holder should silently recite the mantra while burning fragrant incense and cultivating thoughts of loving kindness, compassion, and sympathetic joy.

source: དགའ་བའི་སེམས་དང་ཡིད་བདེ་བར་བྱ། བཀྲ་ཤིས་ཚང་བར་བྱ་ཞིང་སྙིང་དགའ་བ་དང་། མགུ་བ་དང་།
en: He should maintain a happy, joyful, and content frame of mind overflowing with auspicious felicity.

source: རབ་ཏུ་དགའ་བའི་སེམས་སུ་བྱས་ནས་བཟླས་བརྗོད་བྱའོ།
en: That is how he should recite the mantra.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཨ་ག་རུའི་བདུག་པ་དབུལ་བར་བྱ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཏུ་རུ་སྐའི་བདུག་པ་དབུལ་བར་བྱ།
en: He should offer incense of agarwood to Noble Avalokiteśvara, incense of olibanum to all the tathāgatas, and incense of sandalwood to the great goddess Śrī.

source: དཔལ་ལྷ་མོ་ཆེན་མོ་ལ་ཙནྡན་གྱི་བདུག་སྤོས་དབུལ་བར་བྱ་ཞིང་དུས་ཇི་ལྟ་བའི་མེ་ཏོག་དབུལ་བར་བྱ་སྟེ།
en: He should also offer bowls with argha water and seasonal flowers.

source: གསང་སྔགས་འདི་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ་ཐམས་ཅད་ལ་དབུལ་བར་བྱའོ།
en: He should offer all this while reciting this mantra twenty-one times: “Homage to the Three Jewels!

source: ཨོཾ་པུཥྤ་བི་ལོ་ཀི་ཏེ་གན་དྷ་ས་རེ། ཨ་མོ་གྷ་ཛ་ལ་སམ་བྷ་ར་ཎི་པདྨེ་ས་མ་བྷཱུ་རི་ཏ་ར་ཏ་ར་མུ་དེ་ཏེ་བྷཱུཾ་སྭཱ་ཧཱ། ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ་མེ་ཏོག་དང་བདུག་སྤོས་དང་དྲི་དང་མཆོད་ཡོན་དབུལ་ལོ།
en: The vidyā holder should recite this mantra twenty-one times and offer the bowls with argha water, flowers, incense, and fragrances.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་དྲུང་དུ་སྟོང་རྩ་བརྒྱད་བཟླས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བདུན་བཟླས།
en: At the feet of Noble Avalokiteśvara he should recite this mantra one thousand and eight times, the heart mantra of Amoghapāśa seven times, and the mantra of Krodharāja three times.

source: ཁྲོ་བོའི་རྒྱལ་པོ་ལན་གསུམ་བཟླས་ལ་ཨ་ག་རུའི་བདུག་སྤོས་དབུལ་བར་བྱ་ཞིང་ཅི་སྙེད་པའི་མེ་ཏོག་དབུལ་བར་བྱ།
en: He should burn incense of agarwood, offer flowers as available, and light lamps with scented oil.

source: སྤོས་དང་ལྡན་པའི་ཏིལ་མར་གྱི་མར་མེ་བལྟམ་པར་བྱ་ཞིང་དེ་ཉིད་ཀྱི་ཞབས་དྲུང་དུ་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་བལྟས་ལ་སྙིང་པོའི་གཟུངས་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ལ་བཟླས་བརྗོད་ཀྱི་ཕྱག་རྒྱ་བྱས་ཏེ། དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་ལན་བདུན་བཅིང་བ་བྱས་ན།
en: He should sit in a cross-legged posture at the feet of Noble Avalokiteśvara and, looking at him, recite the heart dhāraṇī one hundred and eight times while displaying the mudrā of recitation. “

source: བཅིངས་བ་ཙམ་གྱི་མོད་ལ་སྐུ་གཟུགས་གཡོ་བར་འགྱུར་ཞིང་སྐུ་ཐམས་ཅད་འབར་བར་འགྱུར་རང་གི་ལུས་སྤུ་ཟིང་ཞེས་བྱེད་པར་འགྱུར། ཐོ་རངས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྐུ་སྟོན་པར་འགྱུར་ཏེ།
en: As soon as the vidyā holder has done this one thousand times, the image will move, and Noble Avalokiteśvara will emit light from his entire body, causing the vidyā holder to get goose bumps.

source: ཡིད་ལ་བསམས་པ་ཐམས་ཅད་བཀའ་སྩོལ་བར་འགྱུར། མཆོག་ཐམས་ཅད་སྦྱིན་པར་འགྱུར།
en: At dawn, Noble Avalokiteśvara will appear to the vidyā holder in person, read every thought in his mind, allow him to choose any boons, and grant whatever boons he desires.

source: འདོད་པའི་མཆོག་ཐམས་ཅད་སྦྱིན་པར་འགྱུར། དབུགས་ཀྱང་འབྱིན་པར་འགྱུར། ཡིད་དུ་འོང་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: He will give him comfort and encouragement and fulfill his every wish.

source: ཚེ་འདི་ཉིད་ལ་ནད་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ། །དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་དང་ལྡན་པར་འགྱུར།
en: In this world, the vidyā holder will become free from all disease, plants roots of virtue, and complete his accumulation of merit.

source: སྒྲིབ་པ་དང་སྡིག་པ་ཐམས་ཅད་ཟད་ཅིང་མཐར་ཐུག་པར་འགྱུར།
en: All his obscurations and wrongdoings will diminish and be completely exhausted.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར། ཕས་ཀྱི་རྒོལ་བ་དང་།
en: He will be free from all afflictions.

source: དགྲ་བོ་ཐམས་ཅད་འཇིག་བར་འགྱུར་ཞིང་མི་ཚུགས་པར་འགྱུར་གཡུལ་ངོར་འཇུག་པའི་ཚེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ནས་དམག་གི་ནང་དུ་གཏོར་བ་བྱས་ན་ཐམས་ཅད་རེངས་པར་བྱས་པ་དང་རྨུགས་པར་བྱས་པར་འགྱུར་རོ།
en: All his adversaries and opponents will go away, never to return. “When he enters the thick of battle, he should incant some mustard seeds with the following king of vidyās twenty-one times and cast them into the fray. All opponents will become paralyzed.

source: །འདིའི་སྙིང་པོ་དང་གསང་སྔགས་ནི་འདི་ཡིན་ནོ།
en: The mantras for this are as follows. “

source: ཨོཾ་ཨ་མོ་གྷ་བཱ་ཤ་ཧྲྀ་ད་ཡ་པདྨེ་ནི་བ་ར་དེ་ཛྭ་ལ་ཛྭ་ལ་པྲ་ས་རི་ཏ་པདྨ་བྷུ་ཛེ་སྭཱ་ཧཱ།
en: Hūṁ, svāhā! “

source: སྙིང་པོའི་རིག་སྔགས་སོ། །ཨོཾ་ཨ་བ་ལོ་ཀི་ཏེ་པདྨེ་ནི་བ་རཱང་གི་ནི་ཏུ་རུ་ཏུ་རུ་ཧཱུཾ་སྭཱ་ཧཱ། ཉེ་བའི་སྙིང་པོའི་གཟུངས་སོ། །དོན་ཡོད་པའི་རྒྱ་མཚོའི་ནོར་བུ་པདྨེ་རྣམ་པར་བལྟ་བའི་དཔལ་དྲི་མ་མེད་པ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོའི་གཟུངས་འདི་རྟག་ཏུ་བཟླས་བརྗོད་བྱས་ན་མཚམས་མེད་པ་ལྔ་ཟད་པར་འགྱུར།
en: If this dhāraṇī, immaculately pure Śrī with the gaze of the Holder of the Jewel and the Lotus who is like the ocean of amogha, the heart essence of Amoghapāśa, is recited continually, it will purify the five acts of immediate retribution.

source: དཔལ་ལྷ་མོ་ཆེན་མོ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མཆོག་སྦྱིན་པར་འགྱུར། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དུས་ཀུན་ཏུ་སྐུ་སྟོན་པར་བཞེད་པར་འགྱུར།
en: The great goddess Śrī will always grant boons to the reciter and allow him to see Noble Avalokiteśvara whenever he wants to.

source: དེའི་ལུས་ལ་དུག་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པར་འགྱུར། འཇིགས་པ་ཆེན་པོ་མི་བཟད་པ་བརྒྱད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར། རིམས་ཐམས་ཅད་དང་ནད་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པར་འགྱུར་རོ།
en: No poison will ever harm his body, he will be completely free from the eight great fears, and he will never suffer from fever or disease. “

source: །གདོན་ཐམས་ཅད་ལ་ཚོན་སྣ་ལྔའི་སྲད་བུ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ། མདུད་པ་ཉི་ཤུ་རྩ་གཅིག་པོར་ལ་གུ་གུལ་གྱིས་བདུགས་ཏེ། མགུལ་དུ་བཏགས་ན་གདོན་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: In the event of epileptic seizures, the vidyā holder should incant a five-colored thread twenty-one times, tie twenty-one knots in it, cense it with bdellium, and tie it around the patient’s neck; all seizures will then cease.

source: །གལ་ཏེ་ནག་པོ་ཆེན་པོ་དང་མ་མོའི་ཚོགས་འོངས་ཏེ་རྒྱས་བཏབ་པ་གང་ཡིན་པའང་གདོན་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: Even if Mahākāla himself is present, or the mātṛs are ‘sealed’ in his body, the patient will be cured of all seizures.

source: །སྐུད་པ་ནག་པོས་རིམས་ཉིན་གཅིག་པ་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: If the vidyā holder uses a black thread instead, he will cure quartan fever.

source: གཞན་དག་ལ་ནི་ཐམས་ཅད་དུ་སྲད་བུ་དཀར་པོས་བསལ་བར་བྱའོ།
en: If he desires a girl, he should use a white thread, and he will be able to bring her from anywhere. “

source: །འཐབ་པ་དང་། རྩོད་པ་དང་། ཁྲག་ཁྲུག་ཐམས་ཅད་ལ་གི་ཝང་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ། ཐིག་ལེ་བྱས་ན་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་འགྱུར་རོ།
en: In the event of any quarrel, dispute, contest, or disagreement, the vidyā holder should incant bovine bezoar twenty-one times and mark his forehead with a bindi; he will never be defeated by anyone anywhere.

source: །སྙིང་གར་ཐིག་ལེ་བྱས་ན་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་ལ་སོགས་པ་ཐམས་ཅད་ཀྱིས་མི་མཐོང་བར་འགྱུར་རོ།
en: If he marks his chest with the bindi, he will become invisible to all yakṣas, rākṣasas, bhūtas, piśācas, and so forth.

source: །ལག་མཐིལ་ལ་ཐིག་ལེ་བྱས་ན་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་གང་ལ་རེག་པ་དབང་དུ་འགྱུར་རོ།
en: If he marks the palm of his hand with the bindi, the men, boys, and girls he touches will fall under his thrall. “

source: །སྨིན་མཚམས་སུ་ཐིག་ལེ་བྱས་ན་རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་བཅས་པ་དབང་དུ་འགྱུར་རོ།
en: If the vidyā holder marks a bindi between his eyebrows, the king, together with his harem and retinue, will fall under his thrall.

source: །མགུལ་བར་བྱུགས་ན་རྗེའུ་རིགས་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: If he marks his neck with the bindi, all vaiśyas will fall under his thrall.

source: །དཔུང་པ་གཉིས་ལ་བྱུགས་ན་རྒྱལ་རིགས་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: If he marks his arms with it, all kṣatriyas will fall under his thrall.

source: །དཔྲལ་བའི་སྐྲ་མཚམས་སུ་ཐིག་ལེ་བྱས་ན་བྲམ་ཟེ་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: If he marks the top of his head with it, all brahmins will fall under his thrall.

source: །ལྟེ་བའི་གནས་སུ་ཐིག་ལེ་བྱས་ན་དམངས་རིགས་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: If he makes the bindi mark in the area of his navel, all śūdras will fall under his thrall.

source: །རྐང་པའི་རྗེ་ངར་ལ་བྱུགས་ན་དཔག་ཚད་བརྒྱར་ངལ་བ་མེད་པར་འགྲོ་ཞིང་སླར་ཡང་འོང་བར་འགྱུར་རོ།
en: If he marks his feet and calves with it, he will be able to walk one hundred leagues without getting tired, and even walk back again.

source: །རྐང་མཐིལ་ལ་བསྐུས་ན། ཆུ་ཀླུང་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་འགྱུར་ཞིང་རྒྱ་མཚོའི་བར་དུ་རྒལ་བར་འགྱུར་རོ། །དཔུང་པ་གཉིས་ལ་བྱུགས་ན། གྱད་ཀྱིས་མི་ཐུབ་པར་འགྱུར་རོ།
en: If he marks the soles of his feet, he will be able to ford broad rivers and even cross over an ocean. “

source: །པུས་མོ་གཉིས་ལ་བྱུགས་ན་མེའི་ཕུང་པོ་འབར་ཞིང་རབ་ཏུ་འབར་བར་ཞུགས་ན་ཙནྡན་དང་པུ་ཤེལ་ཙེ་བཞིན་དུ་བསིལ་བར་འགྱུར་རོ།
en: If the vidyā holder marks his arms with the bindi, he will be invincible at wrestling. If he marks his knees and walks into a fire pit or between the blazing walls of fire, it will seem as cool as sandalwood or a field of uśīra grass.

source: །བ་སེར་སྐྱའི་འོ་མ་དང་སྦྱར་ཏེ་མིག་ལ་བསྐུས་ན་མཚན་མོ་ཡང་ཉིན་མོ་བཞིན་དུ་སྣང་བར་འགྱུར་རོ།
en: If he anoints his eyes with the bezoar and adds the milk of a brown cow and human milk, he will be able to see at night as if it were day.

source: །གཏེར་ཐམས་ཅད་འབར་བར་འགྱུར་ཞིང་གལ་ཏེ་བསྐལ་པ་སྟོང་དུ་བཞག་པ་ཞིག་ནའང་འབྱུང་བར་འགྱུར་རོ།
en: All treasure troves will blaze with light and will rise to the surface, even if they had been deposited hundreds of thousands of eons ago.
